tinygo-org/stm32-svd/svd/stm32h753v.svd
        <register>
          <name>I2SCFGR</name>
          <displayName>CGFR</displayName>
          <description>configuration register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCKOE</name>
              <description>Master clock output enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MCKOE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Master clock output disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Master clock output enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ODD</name>
              <description>Odd factor for the
              prescaler</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ODD</name><usage>read-write</usage><enumeratedValue><name>Even</name><description>Real divider value is I2SDIV*2</description><value>0</value></enumeratedValue><enumeratedValue><name>Odd</name><description>Real divider value is I2SDIV*2 + 1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>I2SDIV</name>
              <description>I2S linear prescaler</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DATFMT</name>
              <description>Data format</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DATFMT</name><usage>read-write</usage><enumeratedValue><name>RightAligned</name><description>The data inside RXDR and TXDR are right aligned</description><value>0</value></enumeratedValue><enumeratedValue><name>LeftAligned</name><description>The data inside RXDR and TXDR are left aligned</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WSINV</name>
              <description>Fixed channel length in
              SLAVE</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WSINV</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Word select inversion disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Word select inversion enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FIXCH</name>
              <description>Word select inversion</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FIXCH</name><usage>read-write</usage><enumeratedValue><name>NotFixed</name><description>The channel length in slave mode is different from 16 or 32 bits (CHLEN not taken into account)</description><value>0</value></enumeratedValue><enumeratedValue><name>Fixed</name><description>The channel length in slave mode is supposed to be 16 or 32 bits (according to CHLEN)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CKPOL</name>
              <description>Serial audio clock
              polarity</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CKPOL</name><usage>read-write</usage><enumeratedValue><name>SampleOnRising</name><description>Signals are sampled on rising and changed on falling clock edges</description><value>0</value></enumeratedValue><enumeratedValue><name>SampleOnFalling</name><description>Signals are sampled on falling and changed on rising clock edges</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CHLEN</name>
              <description>Channel length (number of bits per audio
              channel)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CHLEN</name><usage>read-write</usage><enumeratedValue><name>Bits16</name><description>16 bit per channel</description><value>0</value></enumeratedValue><enumeratedValue><name>Bits32</name><description>32 bit per channel</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DATLEN</name>
              <description>Data length to be
              transferred</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>DATLEN</name><usage>read-write</usage><enumeratedValue><name>Bits16</name><description>16 bit data length</description><value>0</value></enumeratedValue><enumeratedValue><name>Bits24</name><description>24 bit data length</description><value>1</value></enumeratedValue><enumeratedValue><name>Bits32</name><description>32 bit data length</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PCMSYNC</name>
              <description>PCM frame synchronization</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PCMSYNC</name><usage>read-write</usage><enumeratedValue><name>Short</name><description>Short PCM frame synchronization</description><value>0</value></enumeratedValue><enumeratedValue><name>Long</name><description>Long PCM frame synchronization</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>I2SSTD</name>
              <description>I2S standard selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>I2SSTD</name><usage>read-write</usage><enumeratedValue><name>Philips</name><description>I2S Philips standard</description><value>0</value></enumeratedValue><enumeratedValue><name>LeftAligned</name><description>MSB/left justified standard</description><value>1</value></enumeratedValue><enumeratedValue><name>RightAligned</name><description>LSB/right justified standard</description><value>2</value></enumeratedValue><enumeratedValue><name>PCM</name><description>PCM standard</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>I2SCFG</name>
              <description>I2S configuration mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>I2SCFG</name><usage>read-write</usage><enumeratedValue><name>SlaveTransmit</name><description>Slave, transmit</description><value>0</value></enumeratedValue><enumeratedValue><name>SlaveReceive</name><description>Slave, recteive</description><value>1</value></enumeratedValue><enumeratedValue><name>MasterTransmit</name><description>Master, transmit</description><value>2</value></enumeratedValue><enumeratedValue><name>MasterReceive</name><description>Master, receive</description><value>3</value></enumeratedValue><enumeratedValue><name>SlaveFullDuplex</name><description>Slave, full duplex</description><value>4</value></enumeratedValue><enumeratedValue><name>MasterFullDuplex</name><description>Master, full duplex</description><value>5</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>I2SMOD</name>
              <description>I2S mode selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>I2SMOD</name><usage>read-write</usage><enumeratedValue><name>SPI</name><description>SPI mode selected</description><value>0</value></enumeratedValue><enumeratedValue><name>I2S</name><description>I2S/PCM mode selected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
