tinygo-org/stm32-svd/svd/stm32h753v.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI2</name>
      <baseAddress>0x40003800</baseAddress>
      <interrupt>
        <name>SPI2</name>
        <description>SPI2 global interrupt</description>
        <value>36</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI3</name>
      <baseAddress>0x40003C00</baseAddress>
      <interrupt>
        <name>SPI3</name>
        <description>SPI3 global interrupt</description>
        <value>51</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI4</name>
      <baseAddress>0x40013400</baseAddress>
      <interrupt>
        <name>SPI4</name>
        <description>SPI4 global interrupt</description>
        <value>84</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI5</name>
      <baseAddress>0x40015000</baseAddress>
      <interrupt>
        <name>SPI5</name>
        <description>SPI5 global interrupt</description>
        <value>85</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI6</name>
      <baseAddress>0x58001400</baseAddress>
      <interrupt>
        <name>SPI6</name>
        <description>SPI6 global interrupt</description>
        <value>86</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>LTDC</name>
      <description>LCD-TFT Controller</description>
      <groupName>LTDC</groupName>
      <baseAddress>0x50001000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LTDC</name>
        <description>LCD-TFT global interrupt</description>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>LTDC_ER</name>
        <description>LCD-TFT error interrupt</description>
        <value>89</value>
      </interrupt>
      <registers>
        <cluster><dim>2</dim><dimIncrement>0x80</dimIncrement><dimIndex>1,2</dimIndex><name>LAYER%s</name><description>Cluster LAYER%s, containing L?CR, L?WHPCR, L?WVPCR, L?CKCR, L?PFCR, L?CACR, L?DCCR, L?BFCR, L?CFBAR, L?CFBLR, L?CFBLNR, L?CLUTWR</description><addressOffset>0x84</addressOffset><register>
          <name>CR</name>
          <displayName>L1CR</displayName>
          <description>Layerx Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLUTEN</name>
              <description>Color Look-Up Table Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CLUTEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Color look-up table disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Color look-up table enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>COLKEN</name>
              <description>Color Keying Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>COLKEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Color keying disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Color keying enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LEN</name>
              <description>Layer Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Layer disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Layer enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WHPCR</name>
          <displayName>L1WHPCR</displayName>
          <description>Layerx Window Horizontal Position
          Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WHSPPOS</name>
              <description>Window Horizontal Stop
              Position</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
            <field>
              <name>WHSTPOS</name>
              <description>Window Horizontal Start
              Position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WVPCR</name>
          <displayName>L1WVPCR</displayName>
          <description>Layerx Window Vertical Position
          Configuration Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WVSPPOS</name>
              <description>Window Vertical Stop
              Position</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>2047</maximum></range></writeConstraint>
            </field>
            <field>
              <name>WVSTPOS</name>
              <description>Window Vertical Start
              Position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>2047</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CKCR</name>
          <displayName>L1CKCR</displayName>
          <description>Layerx Color Keying Configuration
          Register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CKRED</name>
              <description>Color Key Red value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>CKGREEN</name>
              <description>Color Key Green value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>CKBLUE</name>
              <description>Color Key Blue value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PFCR</name>
          <displayName>L1PFCR</displayName>
          <description>Layerx Pixel Format Configuration
          Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PF</name>
              <description>Pixel Format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>PF</name><usage>read-write</usage><enumeratedValue><name>ARGB8888</name><description>ARGB8888</description><value>0</value></enumeratedValue><enumeratedValue><name>RGB888</name><description>RGB888</description><value>1</value></enumeratedValue><enumeratedValue><name>RGB565</name><description>RGB565</description><value>2</value></enumeratedValue><enumeratedValue><name>ARGB1555</name><description>ARGB1555</description><value>3</value></enumeratedValue><enumeratedValue><name>ARGB4444</name><description>ARGB4444</description><value>4</value></enumeratedValue><enumeratedValue><name>L8</name><description>L8 (8-bit luminance)</description><value>5</value></enumeratedValue><enumeratedValue><name>AL44</name><description>AL44 (4-bit alpha, 4-bit luminance)</description><value>6</value></enumeratedValue><enumeratedValue><name>AL88</name><description>AL88 (8-bit alpha, 8-bit luminance)</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CACR</name>
          <displayName>L1CACR</displayName>
          <description>Layerx Constant Alpha Configuration
          Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CONSTA</name>
              <description>Constant Alpha</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCR</name>
          <displayName>L1DCCR</displayName>
          <description>Layerx Default Color Configuration
          Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DCALPHA</name>
              <description>Default Color Alpha</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DCRED</name>
              <description>Default Color Red</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DCGREEN</name>
              <description>Default Color Green</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DCBLUE</name>
              <description>Default Color Blue</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BFCR</name>
          <displayName>L1BFCR</displayName>
          <description>Layerx Blending Factors Configuration
          Register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000607</resetValue>
          <fields>
            <field>
              <name>BF1</name>
              <description>Blending Factor 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>BF1</name><usage>read-write</usage><enumeratedValue><name>Constant</name><description>BF1 = constant alpha</description><value>4</value></enumeratedValue><enumeratedValue><name>Pixel</name><description>BF1 = pixel alpha * constant alpha</description><value>6</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>BF2</name>
              <description>Blending Factor 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>BF2</name><usage>read-write</usage><enumeratedValue><name>Constant</name><description>BF2 = 1 - constant alpha</description><value>5</value></enumeratedValue><enumeratedValue><name>Pixel</name><description>BF2 = 1 - pixel alpha * constant alpha</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFBAR</name>
          <displayName>L1CFBAR</displayName>
          <description>Layerx Color Frame Buffer Address
          Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CFBADD</name>
              <description>Color Frame Buffer Start
              Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CFBLR</name>
          <displayName>L1CFBLR</displayName>
          <description>Layerx Color Frame Buffer Length
          Register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CFBP</name>
              <description>Color Frame Buffer Pitch in
              bytes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>8191</maximum></range></writeConstraint>
            </field>
            <field>
              <name>CFBLL</name>
              <description>Color Frame Buffer Line
              Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>8191</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CFBLNR</name>
          <displayName>L1CFBLNR</displayName>
          <description>Layerx ColorFrame Buffer Line Number
          Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CFBLNBR</name>
              <description>Frame Buffer Line Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>2047</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CLUTWR</name>
          <displayName>L1CLUTWR</displayName>
          <description>Layerx CLUT Write Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLUTADD</name>
              <description>CLUT Address</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>RED</name>
              <description>Red value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>GREEN</name>
              <description>Green value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>BLUE</name>
              <description>Blue value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
