tinygo-org/stm32-svd/svd/stm32h753v.svd
        <register>
          <name>JSQR</name>
          <displayName>JSQR</displayName>
          <description>ADC group injected sequencer
          register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JSQ4</name>
              <description>ADC group injected sequencer rank
              4</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
            <field>
              <name>JSQ3</name>
              <description>ADC group injected sequencer rank
              3</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
            <field>
              <name>JSQ2</name>
              <description>ADC group injected sequencer rank
              2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
            <field>
              <name>JSQ1</name>
              <description>ADC group injected sequencer rank
              1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
            <field>
              <name>JEXTEN</name>
              <description>ADC group injected external trigger
              polarity</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>JEXTEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Trigger detection disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>RisingEdge</name><description>Trigger detection on the rising edge</description><value>1</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Trigger detection on the falling edge</description><value>2</value></enumeratedValue><enumeratedValue><name>BothEdges</name><description>Trigger detection on both the rising and falling edges</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>JEXTSEL</name>
              <description>ADC group injected external trigger
              source</description>
              <bitOffset>2</bitOffset>
              <bitWidth>5</bitWidth>
            <enumeratedValues><name>JEXTSEL</name><usage>read-write</usage><enumeratedValue><name>TIM4_TRGO</name><description>Timer 4 TRGO event</description><value>5</value></enumeratedValue><enumeratedValue><name>TIM8_CC4</name><description>Timer 8 CC4 event</description><value>7</value></enumeratedValue><enumeratedValue><name>TIM8_TRGO</name><description>Timer 8 TRGO event</description><value>9</value></enumeratedValue><enumeratedValue><name>TIM8_TRGO2</name><description>Timer 8 TRGO2 event</description><value>10</value></enumeratedValue><enumeratedValue><name>HRTIM1_ADCTRG2</name><description>HRTIM1_ADCTRG2 event</description><value>16</value></enumeratedValue><enumeratedValue><name>HRTIM1_ADCTRG4</name><description>HRTIM1_ADCTRG4 event</description><value>17</value></enumeratedValue><enumeratedValue><name>LPTIM1_OUT</name><description>LPTIM1_OUT event</description><value>18</value></enumeratedValue><enumeratedValue><name>LPTIM2_OUT</name><description>LPTIM2_OUT event</description><value>19</value></enumeratedValue><enumeratedValue><name>LPTIM3_OUT</name><description>LPTIM3_OUT event</description><value>20</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>JL</name>
              <description>ADC group injected sequencer scan
              length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>3</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OFR1</name>
          <displayName>OFR1</displayName>
          <description>ADC offset number 1 register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SSATE</name>
              <description>Signed saturation enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SSATE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Offset is subtracted maintaining data integrity and extending result size (9-bit and 17-bit signed format)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Offset is subtracted and result is saturated to maintain result size</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OFFSET1_CH</name>
              <description>ADC offset number 1 channel
              selection</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
            <field>
              <name>OFFSET1</name>
              <description>ADC offset number 1 offset
              level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>67108863</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OFR2</name>
          <displayName>OFR2</displayName>
          <description>ADC offset number 2 register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SSATE</name>
              <description>Signed saturation enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SSATE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Offset is subtracted maintaining data integrity and extending result size (9-bit and 17-bit signed format)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Offset is subtracted and result is saturated to maintain result size</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OFFSET2_CH</name>
              <description>ADC offset number 1 channel
              selection</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
            <field>
              <name>OFFSET2</name>
              <description>ADC offset number 1 offset
              level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>67108863</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OFR3</name>
          <displayName>OFR3</displayName>
          <description>ADC offset number 3 register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SSATE</name>
              <description>Signed saturation enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SSATE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Offset is subtracted maintaining data integrity and extending result size (9-bit and 17-bit signed format)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Offset is subtracted and result is saturated to maintain result size</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OFFSET3_CH</name>
              <description>ADC offset number 1 channel
              selection</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
            <field>
              <name>OFFSET3</name>
              <description>ADC offset number 1 offset
              level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>67108863</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OFR4</name>
          <displayName>OFR4</displayName>
          <description>ADC offset number 4 register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SSATE</name>
              <description>Signed saturation enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SSATE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Offset is subtracted maintaining data integrity and extending result size (9-bit and 17-bit signed format)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Offset is subtracted and result is saturated to maintain result size</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OFFSET4_CH</name>
              <description>ADC offset number 1 channel
              selection</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
            <field>
              <name>OFFSET4</name>
              <description>ADC offset number 1 offset
              level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>67108863</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR1</name>
          <displayName>JDR1</displayName>
          <description>ADC group injected sequencer rank 1
          register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JDATA1</name>
              <description>ADC group injected sequencer rank 1
              conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR2</name>
          <displayName>JDR2</displayName>
          <description>ADC group injected sequencer rank 2
          register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JDATA2</name>
              <description>ADC group injected sequencer rank 2
              conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR3</name>
          <displayName>JDR3</displayName>
          <description>ADC group injected sequencer rank 3
          register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JDATA3</name>
              <description>ADC group injected sequencer rank 3
              conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR4</name>
          <displayName>JDR4</displayName>
          <description>ADC group injected sequencer rank 4
          register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JDATA4</name>
              <description>ADC group injected sequencer rank 4
              conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD2CR</name>
          <displayName>AWD2CR</displayName>
          <description>ADC analog watchdog 2 configuration
          register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field><name>AWD2CH0</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>AWD2CH0</name><usage>read-write</usage><enumeratedValue><name>NotMonitored</name><description>Input channel not monitored by AWDx</description><value>0</value></enumeratedValue><enumeratedValue><name>Monitored</name><description>Input channel monitored by AWDx</description><value>1</value></enumeratedValue></enumeratedValues>
            </field><field><name>AWD2CH1</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field><field><name>AWD2CH2</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field><field><name>AWD2CH3</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field><field><name>AWD2CH4</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field><field><name>AWD2CH5</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field><field><name>AWD2CH6</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field><field><name>AWD2CH7</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field><field><name>AWD2CH8</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field><field><name>AWD2CH9</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field><field><name>AWD2CH10</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field><field><name>AWD2CH11</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field><field><name>AWD2CH12</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field><field><name>AWD2CH13</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field><field><name>AWD2CH14</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field><field><name>AWD2CH15</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field><field><name>AWD2CH16</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field><field><name>AWD2CH17</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field><field><name>AWD2CH18</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field><field><name>AWD2CH19</name><description>ADC analog watchdog 2 monitored channel
              selection</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD2CH0" />
            </field></fields>
        </register>
