tinygo-org/stm32-svd/svd/stm32h753v.svd
        <register>
          <name>AWD3CR</name>
          <displayName>AWD3CR</displayName>
          <description>ADC analog watchdog 3 configuration
          register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field><name>AWD3CH0</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>AWD3CH0</name><usage>read-write</usage><enumeratedValue><name>NotMonitored</name><description>Input channel not monitored by AWDx</description><value>0</value></enumeratedValue><enumeratedValue><name>Monitored</name><description>Input channel monitored by AWDx</description><value>1</value></enumeratedValue></enumeratedValues>
            </field><field><name>AWD3CH1</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field><field><name>AWD3CH2</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field><field><name>AWD3CH3</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field><field><name>AWD3CH4</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field><field><name>AWD3CH5</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field><field><name>AWD3CH6</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field><field><name>AWD3CH7</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field><field><name>AWD3CH8</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field><field><name>AWD3CH9</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field><field><name>AWD3CH10</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field><field><name>AWD3CH11</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field><field><name>AWD3CH12</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field><field><name>AWD3CH13</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field><field><name>AWD3CH14</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field><field><name>AWD3CH15</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field><field><name>AWD3CH16</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field><field><name>AWD3CH17</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field><field><name>AWD3CH18</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field><field><name>AWD3CH19</name><description>ADC analog watchdog 3 monitored channel
              selection</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="AWD3CH0" />
            </field></fields>
        </register>
        <register>
          <name>DIFSEL</name>
          <displayName>DIFSEL</displayName>
          <description>ADC channel differential or single-ended
          mode selection register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field><name>DIFSEL0</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>DIFSEL0</name><usage>read-write</usage><enumeratedValue><name>SingleEnded</name><description>Input channel is configured in single-ended mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Differential</name><description>Input channel is configured in differential mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field><field><name>DIFSEL1</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field><field><name>DIFSEL2</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field><field><name>DIFSEL3</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field><field><name>DIFSEL4</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field><field><name>DIFSEL5</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field><field><name>DIFSEL6</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field><field><name>DIFSEL7</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field><field><name>DIFSEL8</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field><field><name>DIFSEL9</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field><field><name>DIFSEL10</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field><field><name>DIFSEL11</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field><field><name>DIFSEL12</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field><field><name>DIFSEL13</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field><field><name>DIFSEL14</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field><field><name>DIFSEL15</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field><field><name>DIFSEL16</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field><field><name>DIFSEL17</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field><field><name>DIFSEL18</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field><field><name>DIFSEL19</name><description>ADC channel differential or single-ended
              mode for channel</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DIFSEL0" />
            </field></fields>
        </register>
        <register>
          <name>CALFACT</name>
          <displayName>CALFACT</displayName>
          <description>ADC calibration factors
          register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CALFACT_D</name>
              <description>ADC calibration factor in differential
              mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>2047</maximum></range></writeConstraint>
            </field>
            <field>
              <name>CALFACT_S</name>
              <description>ADC calibration factor in single-ended
              mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>2047</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCSEL</name>
          <displayName>PCSEL</displayName>
          <description>ADC pre channel selection
          register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCSEL</name>
              <description>Channel x (VINP[i]) pre
              selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            <enumeratedValues><name>PCSEL</name><usage>read-write</usage><enumeratedValue><name>NotPreselected</name><description>Input channel x is not pre-selected</description><value>0</value></enumeratedValue><enumeratedValue><name>Preselected</name><description>Pre-select input channel x</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LTR2</name>
          <displayName>LTR2</displayName>
          <description>ADC watchdog lower threshold register
          2</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LTR2</name>
              <description>Analog watchdog 2 lower
              threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>67108863</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HTR2</name>
          <displayName>HTR2</displayName>
          <description>ADC watchdog higher threshold register
          2</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HTR2</name>
              <description>Analog watchdog 2 higher
              threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>67108863</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LTR3</name>
          <displayName>LTR3</displayName>
          <description>ADC watchdog lower threshold register
          3</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LTR3</name>
              <description>Analog watchdog 3 lower
              threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>67108863</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HTR3</name>
          <displayName>HTR3</displayName>
          <description>ADC watchdog higher threshold register
          3</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HTR3</name>
              <description>Analog watchdog 3 higher
              threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>67108863</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFACT2</name>
          <displayName>CALFACT2</displayName>
          <description>ADC Calibration Factor register
          2</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LINCALFACT</name>
              <description>Linearity Calibration
              Factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>1073741823</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
