tinygo-org/stm32-svd/svd/stm32h753v.svd
        <register>
          <dim>8</dim><dimIncrement>0x4</dimIncrement><dimIndex>0,1,2,3,4,5,6,7</dimIndex><name>RGCR%s</name>
          <displayName>RG0CR</displayName>
          <description>DMAMux - DMA request generator channel x
          control register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIG_ID</name>
              <description>DMA request trigger input
              selected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            <enumeratedValues><name>SIG_ID</name><usage>read-write</usage><enumeratedValue><name>dmamux1_evt0</name><description>Signal `dmamux1_evt0` selected as trigger input</description><value>0</value></enumeratedValue><enumeratedValue><name>dmamux1_evt1</name><description>Signal `dmamux1_evt1` selected as trigger input</description><value>1</value></enumeratedValue><enumeratedValue><name>dmamux1_evt2</name><description>Signal `dmamux1_evt2` selected as trigger input</description><value>2</value></enumeratedValue><enumeratedValue><name>lptim1_out</name><description>Signal `lptim1_out` selected as trigger input</description><value>3</value></enumeratedValue><enumeratedValue><name>lptim2_out</name><description>Signal `lptim2_out` selected as trigger input</description><value>4</value></enumeratedValue><enumeratedValue><name>lptim3_out</name><description>Signal `lptim3_out` selected as trigger input</description><value>5</value></enumeratedValue><enumeratedValue><name>extit0</name><description>Signal `extit0` selected as trigger input</description><value>6</value></enumeratedValue><enumeratedValue><name>tim12_trgo</name><description>Signal `tim12_trgo` selected as trigger input</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OIE</name>
              <description>Interrupt enable at trigger event
              overrun</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>OIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Trigger overrun interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Trigger overrun interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>GE</name>
              <description>DMA request generator channel
              enable/disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>GE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DMA request generation disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DMA request enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>GPOL</name>
              <description>DMA request generator trigger event type
              selection Defines the trigger event on the selected
              DMA request trigger input</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>GPOL</name><usage>read-write</usage><enumeratedValue><name>NoEdge</name><description>No event, i.e. no detection nor generation</description><value>0</value></enumeratedValue><enumeratedValue><name>RisingEdge</name><description>Rising edge</description><value>1</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Falling edge</description><value>2</value></enumeratedValue><enumeratedValue><name>BothEdges</name><description>Rising and falling edges</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>GNBREQ</name>
              <description>Number of DMA requests to generate
              Defines the number of DMA requests generated after a
              trigger event, then stop generating. The actual
              number of generated DMA requests is GNBREQ+1. Note:
              This field can only be written when GE bit is
              reset.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RGSR</name>
          <displayName>RGSR</displayName>
          <description>DMAMux - DMA request generator status
          register</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field><name>OF0</name><description>Trigger event overrun flag The flag is
              set when a trigger event occurs on DMA request
              generator channel x, while the DMA request generator
              counter value is lower than GNBREQ. The flag is
              cleared by writing 1 to the corresponding COFx bit in
              DMAMUX_RGCFR register.</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>OF1</name><description>Trigger event overrun flag The flag is
              set when a trigger event occurs on DMA request
              generator channel x, while the DMA request generator
              counter value is lower than GNBREQ. The flag is
              cleared by writing 1 to the corresponding COFx bit in
              DMAMUX_RGCFR register.</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>OF2</name><description>Trigger event overrun flag The flag is
              set when a trigger event occurs on DMA request
              generator channel x, while the DMA request generator
              counter value is lower than GNBREQ. The flag is
              cleared by writing 1 to the corresponding COFx bit in
              DMAMUX_RGCFR register.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>OF3</name><description>Trigger event overrun flag The flag is
              set when a trigger event occurs on DMA request
              generator channel x, while the DMA request generator
              counter value is lower than GNBREQ. The flag is
              cleared by writing 1 to the corresponding COFx bit in
              DMAMUX_RGCFR register.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>OF4</name><description>Trigger event overrun flag The flag is
              set when a trigger event occurs on DMA request
              generator channel x, while the DMA request generator
              counter value is lower than GNBREQ. The flag is
              cleared by writing 1 to the corresponding COFx bit in
              DMAMUX_RGCFR register.</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>OF5</name><description>Trigger event overrun flag The flag is
              set when a trigger event occurs on DMA request
              generator channel x, while the DMA request generator
              counter value is lower than GNBREQ. The flag is
              cleared by writing 1 to the corresponding COFx bit in
              DMAMUX_RGCFR register.</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>OF6</name><description>Trigger event overrun flag The flag is
              set when a trigger event occurs on DMA request
              generator channel x, while the DMA request generator
              counter value is lower than GNBREQ. The flag is
              cleared by writing 1 to the corresponding COFx bit in
              DMAMUX_RGCFR register.</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>OF7</name><description>Trigger event overrun flag The flag is
              set when a trigger event occurs on DMA request
              generator channel x, while the DMA request generator
              counter value is lower than GNBREQ. The flag is
              cleared by writing 1 to the corresponding COFx bit in
              DMAMUX_RGCFR register.</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>RGCFR</name>
          <displayName>RGCFR</displayName>
          <description>DMAMux - DMA request generator clear flag
          register</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field><name>COF0</name><description>Clear trigger event overrun flag Upon
              setting, this bit clears the corresponding overrun
              flag OFx in the DMAMUX_RGCSR register.</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>COF1</name><description>Clear trigger event overrun flag Upon
              setting, this bit clears the corresponding overrun
              flag OFx in the DMAMUX_RGCSR register.</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>COF2</name><description>Clear trigger event overrun flag Upon
              setting, this bit clears the corresponding overrun
              flag OFx in the DMAMUX_RGCSR register.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>COF3</name><description>Clear trigger event overrun flag Upon
              setting, this bit clears the corresponding overrun
              flag OFx in the DMAMUX_RGCSR register.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>COF4</name><description>Clear trigger event overrun flag Upon
              setting, this bit clears the corresponding overrun
              flag OFx in the DMAMUX_RGCSR register.</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>COF5</name><description>Clear trigger event overrun flag Upon
              setting, this bit clears the corresponding overrun
              flag OFx in the DMAMUX_RGCSR register.</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>COF6</name><description>Clear trigger event overrun flag Upon
              setting, this bit clears the corresponding overrun
              flag OFx in the DMAMUX_RGCSR register.</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>COF7</name><description>Clear trigger event overrun flag Upon
              setting, this bit clears the corresponding overrun
              flag OFx in the DMAMUX_RGCSR register.</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>DMAMUX request line multiplexer interrupt
          channel status register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field><name>SOF0</name><description>Synchronization overrun event
              flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF1</name><description>Synchronization overrun event
              flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF2</name><description>Synchronization overrun event
              flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF3</name><description>Synchronization overrun event
              flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF4</name><description>Synchronization overrun event
              flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF5</name><description>Synchronization overrun event
              flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF6</name><description>Synchronization overrun event
              flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF7</name><description>Synchronization overrun event
              flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF8</name><description>Synchronization overrun event
              flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF9</name><description>Synchronization overrun event
              flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF10</name><description>Synchronization overrun event
              flag</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF11</name><description>Synchronization overrun event
              flag</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF12</name><description>Synchronization overrun event
              flag</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF13</name><description>Synchronization overrun event
              flag</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF14</name><description>Synchronization overrun event
              flag</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF15</name><description>Synchronization overrun event
              flag</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>CFR</name>
          <displayName>CFR</displayName>
          <description>DMAMUX request line multiplexer interrupt
          clear flag register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field><name>CSOF0</name><description>Clear synchronization overrun event
              flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF1</name><description>Clear synchronization overrun event
              flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF2</name><description>Clear synchronization overrun event
              flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF3</name><description>Clear synchronization overrun event
              flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF4</name><description>Clear synchronization overrun event
              flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF5</name><description>Clear synchronization overrun event
              flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF6</name><description>Clear synchronization overrun event
              flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF7</name><description>Clear synchronization overrun event
              flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF8</name><description>Clear synchronization overrun event
              flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF9</name><description>Clear synchronization overrun event
              flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF10</name><description>Clear synchronization overrun event
              flag</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF11</name><description>Clear synchronization overrun event
              flag</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF12</name><description>Clear synchronization overrun event
              flag</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF13</name><description>Clear synchronization overrun event
              flag</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF14</name><description>Clear synchronization overrun event
              flag</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF15</name><description>Clear synchronization overrun event
              flag</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
