tinygo-org/stm32-svd/svd/stm32h753v.svd
        <register>
          <name>CIFR</name>
          <displayName>CIFR</displayName>
          <description>RCC Clock Source Interrupt Flag
          Register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LSIRDYF</name>
              <description>LSI ready Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSERDYF</name>
              <description>LSE ready Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIRDYF</name>
              <description>HSI ready Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSERDYF</name>
              <description>HSE ready Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSIRDY</name>
              <description>CSI ready Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSI48RDYF</name>
              <description>RC48 ready Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1RDYF</name>
              <description>PLL1 ready Interrupt Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2RDYF</name>
              <description>PLL2 ready Interrupt Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3RDYF</name>
              <description>PLL3 ready Interrupt Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSECSSF</name>
              <description>LSE clock security system Interrupt
              Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSECSSF</name>
              <description>HSE clock security system Interrupt
              Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CICR</name>
          <displayName>CICR</displayName>
          <description>RCC Clock Source Interrupt Clear
          Register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LSIRDYC</name>
              <description>LSI ready Interrupt Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LSIRDYC</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear interrupt flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LSERDYC</name>
              <description>LSE ready Interrupt Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LSIRDYC" />
            </field>
            <field>
              <name>HSIRDYC</name>
              <description>HSI ready Interrupt Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LSIRDYC" />
            </field>
            <field>
              <name>HSERDYC</name>
              <description>HSE ready Interrupt Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LSIRDYC" />
            </field>
            <field>
              <name>HSE_ready_Interrupt_Clear</name>
              <description>CSI ready Interrupt Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSI48RDYC</name>
              <description>RC48 ready Interrupt Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LSIRDYC" />
            </field>
            <field>
              <name>PLL1RDYC</name>
              <description>PLL1 ready Interrupt Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LSIRDYC" />
            </field>
            <field>
              <name>PLL2RDYC</name>
              <description>PLL2 ready Interrupt Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LSIRDYC" />
            </field>
            <field>
              <name>PLL3RDYC</name>
              <description>PLL3 ready Interrupt Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LSIRDYC" />
            </field>
            <field>
              <name>LSECSSC</name>
              <description>LSE clock security system Interrupt
              Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LSIRDYC" />
            </field>
            <field>
              <name>HSECSSC</name>
              <description>HSE clock security system Interrupt
              Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LSIRDYC" />
            </field>
          </fields>
        </register>
        <register>
          <name>BDCR</name>
          <displayName>BDCR</displayName>
          <description>RCC Backup Domain Control
          Register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LSEON</name>
              <description>LSE oscillator enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LSEON</name><usage>read-write</usage><enumeratedValue><name>Off</name><description>LSE oscillator Off</description><value>0</value></enumeratedValue><enumeratedValue><name>On</name><description>LSE oscillator On</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LSERDY</name>
              <description>LSE oscillator ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LSERDYR</name><usage>read</usage><enumeratedValue><name>NotReady</name><description>LSE oscillator not ready</description><value>0</value></enumeratedValue><enumeratedValue><name>Ready</name><description>LSE oscillator ready</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LSEBYP</name>
              <description>LSE oscillator bypass</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LSEBYP</name><usage>read-write</usage><enumeratedValue><name>NotBypassed</name><description>LSE crystal oscillator not bypassed</description><value>0</value></enumeratedValue><enumeratedValue><name>Bypassed</name><description>LSE crystal oscillator bypassed with external clock</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LSEDRV</name>
              <description>LSE oscillator driving
              capability</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>LSEDRV</name><usage>read-write</usage><enumeratedValue><name>Lowest</name><description>Lowest LSE oscillator driving capability</description><value>0</value></enumeratedValue><enumeratedValue><name>MediumLow</name><description>Medium low LSE oscillator driving capability</description><value>1</value></enumeratedValue><enumeratedValue><name>MediumHigh</name><description>Medium high LSE oscillator driving capability</description><value>2</value></enumeratedValue><enumeratedValue><name>Highest</name><description>Highest LSE oscillator driving capability</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LSECSSON</name>
              <description>LSE clock security system
              enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LSECSSON</name><usage>read-write</usage><enumeratedValue><name>SecurityOff</name><description>Clock security system on 32 kHz oscillator off</description><value>0</value></enumeratedValue><enumeratedValue><name>SecurityOn</name><description>Clock security system on 32 kHz oscillator on</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LSECSSD</name>
              <description>LSE clock security system failure
              detection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LSECSSDR</name><usage>read</usage><enumeratedValue><name>NoFailure</name><description>No failure detected on 32 kHz oscillator</description><value>0</value></enumeratedValue><enumeratedValue><name>Failure</name><description>Failure detected on 32 kHz oscillator</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RTCSEL</name>
              <description>RTC clock source selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>RTCSEL</name><usage>read-write</usage><enumeratedValue><name>NoClock</name><description>No clock</description><value>0</value></enumeratedValue><enumeratedValue><name>LSE</name><description>LSE oscillator clock used as RTC clock</description><value>1</value></enumeratedValue><enumeratedValue><name>LSI</name><description>LSI oscillator clock used as RTC clock</description><value>2</value></enumeratedValue><enumeratedValue><name>HSE</name><description>HSE oscillator clock divided by a prescaler used as RTC clock</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RTCEN</name>
              <description>RTC clock enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RTCEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>RTC clock disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>RTC clock enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>BDRST</name>
              <description>VSwitch domain software
              reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>BDRST</name><usage>read-write</usage><enumeratedValue><name>Reset</name><description>Resets the entire VSW domain</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>RCC Clock Control and Status
          Register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LSION</name>
              <description>LSI oscillator enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LSION</name><usage>read-write</usage><enumeratedValue><name>Off</name><description>LSI oscillator Off</description><value>0</value></enumeratedValue><enumeratedValue><name>On</name><description>LSI oscillator On</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LSIRDY</name>
              <description>LSI oscillator ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LSIRDYR</name><usage>read</usage><enumeratedValue><name>NotReady</name><description>LSI oscillator not ready</description><value>0</value></enumeratedValue><enumeratedValue><name>Ready</name><description>LSI oscillator ready</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB3RSTR</name>
          <displayName>AHB3RSTR</displayName>
          <description>RCC AHB3 Reset Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDMARST</name>
              <description>MDMA block reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MDMARST</name><usage>read-write</usage><enumeratedValue><name>Reset</name><description>Reset the selected module</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DMA2DRST</name>
              <description>DMA2D block reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MDMARST" />
            </field>
            <field>
              <name>JPGDECRST</name>
              <description>JPGDEC block reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MDMARST" />
            </field>
            <field>
              <name>FMCRST</name>
              <description>FMC block reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MDMARST" />
            </field>
            <field>
              <name>QSPIRST</name>
              <description>QUADSPI and QUADSPI delay block
              reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MDMARST" />
            </field>
            <field>
              <name>SDMMC1RST</name>
              <description>SDMMC1 and SDMMC1 delay block
              reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MDMARST" />
            </field>
            <field>
              <name>CPURST</name>
              <description>CPU reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MDMARST" />
            </field>
          </fields>
        </register>
        <register>
          <name>AHB1RSTR</name>
          <displayName>AHB1RSTR</displayName>
          <description>RCC AHB1 Peripheral Reset
          Register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMA1RST</name>
              <description>DMA1 block reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DMA1RST</name><usage>read-write</usage><enumeratedValue><name>Reset</name><description>Reset the selected module</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DMA2RST</name>
              <description>DMA2 block reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DMA1RST" />
            </field>
            <field>
              <name>ADC12RST</name>
              <description>ADC1&amp;2 block reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DMA1RST" />
            </field>
            <field>
              <name>ETH1MACRST</name>
              <description>ETH1MAC block reset</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DMA1RST" />
            </field>
            <field>
              <name>USB1OTGRST</name>
              <description>USB1OTG block reset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DMA1RST" />
            </field>
            <field>
              <name>USB2OTGRST</name>
              <description>USB2OTG block reset</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DMA1RST" />
            </field>
          </fields>
        </register>
        <register>
          <name>AHB2RSTR</name>
          <displayName>AHB2RSTR</displayName>
          <description>RCC AHB2 Peripheral Reset
          Register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CAMITFRST</name>
              <description>CAMITF block reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CAMITFRST</name><usage>read-write</usage><enumeratedValue><name>Reset</name><description>Reset the selected module</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CRYPTRST</name>
              <description>Cryptography block reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CAMITFRST" />
            </field>
            <field>
              <name>HASHRST</name>
              <description>Hash block reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CAMITFRST" />
            </field>
            <field>
              <name>RNGRST</name>
              <description>Random Number Generator block
              reset</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CAMITFRST" />
            </field>
            <field>
              <name>SDMMC2RST</name>
              <description>SDMMC2 and SDMMC2 Delay block
              reset</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CAMITFRST" />
            </field>
          </fields>
        </register>
