tinygo-org/stm32-svd/svd/stm32h753v.svd
        <register>
          <name>CFGR</name>
          <displayName>CFGR</displayName>
          <description>Configuration Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENC</name>
              <description>Encoder mode enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ENC</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Encoder mode disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Encoder mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>COUNTMODE</name>
              <description>counter mode enabled</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>COUNTMODE</name><usage>read-write</usage><enumeratedValue><name>Internal</name><description>The counter is incremented following each internal clock pulse</description><value>0</value></enumeratedValue><enumeratedValue><name>External</name><description>The counter is incremented following each valid clock pulse on the LPTIM external Input1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PRELOAD</name>
              <description>Registers update mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PRELOAD</name><usage>read-write</usage><enumeratedValue><name>Immediate</name><description>Registers are updated after each APB bus write access</description><value>0</value></enumeratedValue><enumeratedValue><name>EndOfPeriod</name><description>Registers are updated at the end of the current LPTIM period</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WAVPOL</name>
              <description>Waveform shape polarity</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WAVPOL</name><usage>read-write</usage><enumeratedValue><name>Positive</name><description>The LPTIM output reflects the compare results between LPTIM_ARR and LPTIM_CMP registers</description><value>0</value></enumeratedValue><enumeratedValue><name>Negative</name><description>The LPTIM output reflects the inverse of the compare results between LPTIM_ARR and LPTIM_CMP registers</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WAVE</name>
              <description>Waveform shape</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WAVE</name><usage>read-write</usage><enumeratedValue><name>Inactive</name><description>Deactivate Set-once mode, PWM / One Pulse waveform (depending on OPMODE bit)</description><value>0</value></enumeratedValue><enumeratedValue><name>Active</name><description>Activate the Set-once mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TIMOUT</name>
              <description>Timeout enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TIMOUT</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>A trigger event arriving when the timer is already started will be ignored</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>A trigger event arriving when the timer is already started will reset and restart the counter</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TRIGEN</name>
              <description>Trigger enable and
              polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>TRIGEN</name><usage>read-write</usage><enumeratedValue><name>SW</name><description>Software trigger (counting start is initiated by software)</description><value>0</value></enumeratedValue><enumeratedValue><name>RisingEdge</name><description>Rising edge is the active edge</description><value>1</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Falling edge is the active edge</description><value>2</value></enumeratedValue><enumeratedValue><name>BothEdges</name><description>Both edges are active edges</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TRIGSEL</name>
              <description>Trigger selector</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>TRIGSEL</name><usage>read-write</usage><enumeratedValue><name>Trig0</name><description>lptim_ext_trig0</description><value>0</value></enumeratedValue><enumeratedValue><name>Trig1</name><description>lptim_ext_trig1</description><value>1</value></enumeratedValue><enumeratedValue><name>Trig2</name><description>lptim_ext_trig2</description><value>2</value></enumeratedValue><enumeratedValue><name>Trig3</name><description>lptim_ext_trig3</description><value>3</value></enumeratedValue><enumeratedValue><name>Trig4</name><description>lptim_ext_trig4</description><value>4</value></enumeratedValue><enumeratedValue><name>Trig5</name><description>lptim_ext_trig5</description><value>5</value></enumeratedValue><enumeratedValue><name>Trig6</name><description>lptim_ext_trig6</description><value>6</value></enumeratedValue><enumeratedValue><name>Trig7</name><description>lptim_ext_trig7</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PRESC</name>
              <description>Clock prescaler</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>PRESC</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>/1</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>/2</description><value>1</value></enumeratedValue><enumeratedValue><name>Div4</name><description>/4</description><value>2</value></enumeratedValue><enumeratedValue><name>Div8</name><description>/8</description><value>3</value></enumeratedValue><enumeratedValue><name>Div16</name><description>/16</description><value>4</value></enumeratedValue><enumeratedValue><name>Div32</name><description>/32</description><value>5</value></enumeratedValue><enumeratedValue><name>Div64</name><description>/64</description><value>6</value></enumeratedValue><enumeratedValue><name>Div128</name><description>/128</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TRGFLT</name>
              <description>Configurable digital filter for
              trigger</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>TRGFLT</name><usage>read-write</usage><enumeratedValue><name>Immediate</name><description>Any trigger active level change is considered as a valid trigger</description><value>0</value></enumeratedValue><enumeratedValue><name>Clocks2</name><description>Trigger active level change must be stable for at least 2 clock periods before it is considered as valid trigger</description><value>1</value></enumeratedValue><enumeratedValue><name>Clocks4</name><description>Trigger active level change must be stable for at least 4 clock periods before it is considered as valid trigger</description><value>2</value></enumeratedValue><enumeratedValue><name>Clocks8</name><description>Trigger active level change must be stable for at least 8 clock periods before it is considered as valid trigger</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CKFLT</name>
              <description>Configurable digital filter for external
              clock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>CKFLT</name><usage>read-write</usage><enumeratedValue><name>Immediate</name><description>Any external clock signal level change is considered as a valid transition</description><value>0</value></enumeratedValue><enumeratedValue><name>Clocks2</name><description>External clock signal level change must be stable for at least 2 clock periods before it is considered as valid transition</description><value>1</value></enumeratedValue><enumeratedValue><name>Clocks4</name><description>External clock signal level change must be stable for at least 4 clock periods before it is considered as valid transition</description><value>2</value></enumeratedValue><enumeratedValue><name>Clocks8</name><description>External clock signal level change must be stable for at least 8 clock periods before it is considered as valid transition</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CKPOL</name>
              <description>Clock Polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>CKPOL</name><usage>read-write</usage><enumeratedValue><name>RisingEdge</name><description>The rising edge is the active edge used for counting. If LPTIM is in encoder mode: Encoder sub-mode 1 is active.</description><value>0</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>The falling edge is the active edge used for counting. If LPTIM is in encoder mode: Encoder sub-mode 2 is active.</description><value>1</value></enumeratedValue><enumeratedValue><name>BothEdges</name><description>Both edges are active edge. If LPTIM is in encoder mode: Encoder sub-mode 3 is active.</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CKSEL</name>
              <description>Clock selector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CKSEL</name><usage>read-write</usage><enumeratedValue><name>Internal</name><description>LPTIM is clocked by internal clock source (APB clock or any of the embedded oscillators)</description><value>0</value></enumeratedValue><enumeratedValue><name>External</name><description>LPTIM is clocked by an external clock source through the LPTIM external Input1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>LPTIM Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ENABLE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>LPTIM is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>LPTIM is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SNGSTRT</name>
              <description>LPTIM start in single mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SNGSTRTW</name><usage>write</usage><enumeratedValue><name>Start</name><description>LPTIM start in Single mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CNTSTRT</name>
              <description>Timer start in continuous
              mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CNTSTRTW</name><usage>write</usage><enumeratedValue><name>Start</name><description>Timer start in Continuous mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>COUNTRST</name>
              <description>Counter reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTARE</name>
              <description>Reset after read enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMP</name>
          <displayName>CMP</displayName>
          <description>Compare Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMP</name>
              <description>Compare value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ARR</name>
          <displayName>ARR</displayName>
          <description>Autoreload Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>ARR</name>
              <description>Auto reload value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <displayName>CNT</displayName>
          <description>Counter Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>Counter value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <displayName>CFGR2</displayName>
          <description>LPTIM configuration register 2</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IN1SEL</name>
              <description>LPTIM Input 1 selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IN2SEL</name>
              <description>LPTIM Input 2 selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
