tinygo-org/stm32-svd/svd/stm32h753v.svd
        <register>
          <name>CPUEMR3</name>
          <displayName>CPUEMR3</displayName>
          <description>EXTI event mask register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MR64</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MR64</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>Interrupt request line is masked</description><value>0</value></enumeratedValue><enumeratedValue><name>Unmasked</name><description>Interrupt request line is unmasked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MR65</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR66</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR67</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR68</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR69</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR70</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR71</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR72</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR73</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR74</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR75</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR76</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR77</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR78</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR79</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR80</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR82</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR84</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR85</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR86</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR87</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
            <field>
              <name>MR88</name>
              <description>CPU Event mask on Event input
              x+64</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR64" />
            </field>
          </fields>
        </register>
        <register>
          <name>CPUPR3</name>
          <displayName>CPUPR3</displayName>
          <description>EXTI pending register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PR82</name>
              <description>Configurable event inputs x+64 Pending
              bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PR82R</name><usage>read</usage><enumeratedValue><name>NotPending</name><description>No trigger request occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Pending</name><description>Selected trigger request occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>PR82W</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears pending bit</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PR84</name>
              <description>Configurable event inputs x+64 Pending
              bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="PR82R" />
            <enumeratedValues derivedFrom="PR82W" />
            </field>
            <field>
              <name>PR85</name>
              <description>Configurable event inputs x+64 Pending
              bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="PR82R" />
            <enumeratedValues derivedFrom="PR82W" />
            </field>
            <field>
              <name>PR86</name>
              <description>Configurable event inputs x+64 Pending
              bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="PR82R" />
            <enumeratedValues derivedFrom="PR82W" />
            </field>
          </fields>
        </register>
