tinygo-org/stm32-svd/svd/stm32h753v.svd
        <register><name>M5FECR</name><description>RAMECC monitor 5 failing error code register</description><addressOffset>180</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FEC</name><description>ECC failing code</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        </registers></peripheral>
    <peripheral derivedFrom="RAMECC1"><name>RAMECC2</name><baseAddress>1208102912</baseAddress></peripheral>
    <peripheral><name>RAMECC3</name><description>RAM ECC monitoring</description><groupName>RAMECC</groupName><baseAddress>1476554752</baseAddress><registers><register><name>IER</name><description>RAMECC interrupt enable register</description><addressOffset>0</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>GECCDEBWIE</name><description>Global ECC double error on byte write interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>GECCDEIE</name><description>Global ECC double error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>GECCSEIE</name><description>Global ECC single error interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>GIE</name><description>Global interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M1CR</name><description>RAMECC monitor 1 configuration register</description><addressOffset>32</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>ECCELEN</name><description>ECC error context latching enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEBWIE</name><description>ECC double error on byte write interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEIE</name><description>ECC double error interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCSEIE</name><description>ECC single error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M1SR</name><description>RAMECC monitor 1 status register</description><addressOffset>36</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>DEBWDF</name><description>ECC double error on byte write flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>DEDF</name><description>ECC double error detected flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>SEDCF</name><description>ECC single error detected flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M1FAR</name><description>RAMECC monitor 1 failing address register</description><addressOffset>40</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FADD</name><description>ECC failing address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M1FDRL</name><description>RAMECC monitor 1 failing data low register</description><addressOffset>44</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAL</name><description>ECC failing data low</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M1FDRH</name><description>RAMECC monitor 1 failing data high register</description><addressOffset>48</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAH</name><description>ECC failing data high</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M1FECR</name><description>RAMECC monitor 1 failing error code register</description><addressOffset>52</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FEC</name><description>ECC failing code</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M2CR</name><description>RAMECC monitor 2 configuration register</description><addressOffset>64</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>ECCELEN</name><description>ECC error context latching enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEBWIE</name><description>ECC double error on byte write interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEIE</name><description>ECC double error interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCSEIE</name><description>ECC single error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M2SR</name><description>RAMECC monitor 2 status register</description><addressOffset>68</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>DEBWDF</name><description>ECC double error on byte write flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>DEDF</name><description>ECC double error detected flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>SEDCF</name><description>ECC single error detected flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M2FAR</name><description>RAMECC monitor 2 failing address register</description><addressOffset>72</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FADD</name><description>ECC failing address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M2FDRL</name><description>RAMECC monitor 2 failing data low register</description><addressOffset>76</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAL</name><description>ECC failing data low</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M2FDRH</name><description>RAMECC monitor 2 failing data high register</description><addressOffset>80</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAH</name><description>ECC failing data high</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M2FECR</name><description>RAMECC monitor 2 failing error code register</description><addressOffset>84</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FEC</name><description>ECC failing code</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        </registers></peripheral>
    </peripherals>
</device>